In [3]:
#Series pandas data structure
import pandas as pd
x=[2,3,4,5]
sr=pd.Series(x)
sr

0    2
1    3
2    4
3    5
dtype: int64

In [4]:
import pandas as pd
d1={'name':['python','c++'],'Per':[45,67],'Rank':[2,1]}
sr2=pd.Series(d1)
sr2

name    [python, c++]
Per          [45, 67]
Rank           [2, 1]
dtype: object

In [5]:
sr3=pd.Series(12,index=[1,2,3,4,5])
sr4=pd.Series(13,index=[1,2,3,4])
print(sr3+sr4)

1    25.0
2    25.0
3    25.0
4    25.0
5     NaN
dtype: float64

In [6]:
#Data Frame in list
lst1 = [[1,2,3],[4,5,6]]
df1=pd.DataFrame(lst1)
df1

   0  1  2
0  1  2  3
1  4  5  6

In [7]:
#Data Frame in dictionary
d1={'a':[2,3,4,5],'b':[4,5,6,7],'c':[7,4,2,4]}
df2=pd.DataFrame(d1,index=['x','y','z','w'])
df2

   a  b  c
x  2  4  7
y  3  5  4
z  4  6  2
w  5  7  4

In [8]:
#Data Frame in dictionary
d1={'a':[2,3,4,5],'b':[4,5,6,7],'c':[7,4,2,4]}
df2=pd.DataFrame(d1,columns=['a','c'],index=['x','y','z','w'])
df2

   a  c
x  2  7
y  3  4
z  4  2
w  5  4

In [9]:
df1=pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8]})
df1['C']=df1['A']*df1['B']
df1['D']=df1['A']+df1['B']
df1['E']=df1['A']-df1['B']
df1['F']=df1['A']/df1['B']
df1

   A  B   C   D  E         F
0  1  5   5   6 -4  0.200000
1  2  6  12   8 -4  0.333333
2  3  7  21  10 -4  0.428571
3  4  8  32  12 -4  0.500000

In [10]:
#Condition Check Among the Columns
df1['F']=df1['A'] >=3
df1['G']=df1['B'] >=6
df1

   A  B   C   D  E      F      G
0  1  5   5   6 -4  False  False
1  2  6  12   8 -4  False   True
2  3  7  21  10 -4   True   True
3  4  8  32  12 -4   True   True

In [11]:
#slicing
import pandas as pd
df1['H']=df1['C'][:3]
df1

   A  B   C   D  E      F      G     H
0  1  5   5   6 -4  False  False   5.0
1  2  6  12   8 -4  False   True  12.0
2  3  7  21  10 -4   True   True  21.0
3  4  8  32  12 -4   True   True   NaN

In [48]:
#Made new column at dedicated index
df1=pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8]})
df1.insert(1,'C',['a','b','c','d'])
df1

   A  C  B
0  1  a  5
1  2  b  6
2  3  c  7
3  4  d  8

In [49]:
#Deletion & PoP function difference

#pop1
var1=df1.pop('B')
var1

0    5
1    6
2    7
3    8
Name: B, dtype: int64

In [25]:
#pop1

df1

   A  C
0  1  a
1  2  b
2  3  c
3  4  d

In [31]:
df1

   A  C
0  1  a
1  2  b
2  3  c
3  4  d

In [32]:
#delete
del df1['A']

In [33]:
df1

   C
0  a
1  b
2  c
3  d

In [ ]:
csv(comma separated value):
-----------------------------
name,loc,sal,dep
pankanj,noida,5,hr
munde,mumbai,3,politician

In [50]:
import pandas as pd
df1=pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8]})
df1.to_csv('new.csv')